clc;
clear;
data = [
       91.8000	2.5200	99.9170	12.8370	0	427265;
91.6000	2.6100	99.2840	13.8750	0.1	432216;
91	2.4700	99.1160	14.0110	0	422808;
];
%% 

y = [-1.26818656235382;-1.36449853105365;-0.940301931665317;0.736177089031146;1.48119009106168;1.35561984497995];

x1 =  [87.5 87.7 88 89.3 89.1 89]';
x2 = [2.3 3.1 4.7 4.1 5.9 2.7]';
x3 = [48 48 48 49 50 50]';
x4 = [29.6 30.1 30.6 31.3 32 32.6]';
x5 = [9 4 4 5 7 6]';
x6 = [429570 433192 429989 427265 432216 422808]';

%%

u1 = [1.25 -0.688 -4.00 5.500 1.312 1.375]';
u2 = [0.875 -0.062 -3.25 3.00 0.500 1.5]';
f1 = data * u1
f2 = data * u2

%%

F = [ones(size(y)) f1 f2];
[b, bint, r, rint, status] = regress(y, F)
scatter3(f1, f2, y, 'filled')
%%

hold on  %不要清楚计算数据，在刚刚那副散点图上接着画  
f1fit = min(f1):1000:max(f1);   %设置x1的数据间隔  
f2fit = min(f2):100:max(f2);     %设置x2的数据间隔  
[F1FIT,F2FIT] = meshgrid(f1fit,f2fit);  %生成一个二维网格平面，也可以说生成X1FIT,X2FIT的坐标  
YFIT=b(1) + b(2) * F1FIT + b(3) * F2FIT;    %代入已经求得的参数，拟合函数式  
mesh(F1FIT,F2FIT,YFIT)    %X1FIT，X2FIT是网格坐标矩阵，YFIT是网格点上的高度矩阵  
view(10,10)  %改变角度观看已存在的三维图，第一个10表示方位角，第二个表示俯视角。  
             %方位角相当于球坐标中的经度，俯视角相当于球坐标中的纬度  
xlabel('f1') %设置X轴的名称  
ylabel('f2') %设置y轴的名称  
zlabel('y')  %设置z轴的名称
title('PCR')
